app/views/pages/pages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>pages</title>
<!-- 2014-07-09 Wed 22:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ander" />
</head>
<body>
<div id="content">
<h1 class="title">pages</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Application</a>
<ul>
<li><a href="#sec-1-1">1.1. Resources</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Pages</a>
<ul>
<li><a href="#sec-2-1">2.1. Partials</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Header</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Home</a></li>
<li><a href="#sec-2-3">2.3. About</a></li>
<li><a href="#sec-2-4">2.4. News</a></li>
<li><a href="#sec-2-5">2.5. Programs</a></li>
<li><a href="#sec-2-6">2.6. Calendar</a></li>
<li><a href="#sec-2-7">2.7. Contact</a></li>
<li><a href="#sec-2-8">2.8. Staff &amp; Board</a></li>
<li><a href="#sec-2-9">2.9. Employment</a></li>
<li><a href="#sec-2-10">2.10. Donate</a></li>
<li><a href="#sec-2-11">2.11. Summer Camp</a></li>
<li><a href="#sec-2-12">2.12. Children's Country Fair</a>
<ul>
<li><a href="#sec-2-12-1">2.12.1. Images</a></li>
<li><a href="#sec-2-12-2">2.12.2. Volunteer Application</a></li>
</ul>
</li>
<li><a href="#sec-2-13">2.13. Shifts</a></li>
<li><a href="#sec-2-14">2.14. sandbox</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="../../../README.html">Prairie Hill Learning Center</a>
</p>

<p>
<a href="./.">Directory</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Application</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="../layouts/application.html.erb">../layouts/application.html.erb</a>
</p>
</div>


<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Resources</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="../../../config/routes.rb">Routes</a>
</p>

<p>
<a href="../../controllers">Controllers</a>
</p>

<p>
<a href="../devise">Devise</a>
</p>

<p>
<a href="../shifts">Shifts</a>
</p>

<p>
<a href="../../assets/stylesheets/">Stylesheets</a>
</p>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Pages</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <a href="../layouts">Partials</a></h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> <a href="../layouts/_header.html.erb">Header</a></h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
<a href="../layouts/_user_menu.html.erb">User Menu</a>
</p>

<p>
<a href="./_page_add_quote.html.erb">Quote</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Home</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="./home.html.erb">./home.html.erb</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> About</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="./_about.html.erb">./_about.html.erb</a>
<a href="./_about2.html.erb">./_about2.html.erb</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> News</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="./news.html.erb">./news.html.erb</a>
<a href="./_news.html.erb">./_news.html.erb</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Programs</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<a href="./programs.html.erb">./programs.html.erb</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Calendar</h3>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Contact</h3>
</div>

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> Staff &amp; Board</h3>
<div class="outline-text-3" id="text-2-8">
<p>
<a href="./staff.html.erb">./staff.html.erb</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> Employment</h3>
</div>

<div id="outline-container-sec-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> Donate</h3>
</div>

<div id="outline-container-sec-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> Summer Camp</h3>
</div>

<div id="outline-container-sec-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> Children's Country Fair</h3>
<div class="outline-text-3" id="text-2-12">
<p>
<a href="../shifts/volunteer.html.erb">../shifts/volunteer.html.erb</a>
</p>

<p>
<a href="../../controllers/shifts_controller.rb">../../controllers/shifts_controller.rb</a>
</p>

<p>
<a href="../../models/shift.rb">../../models/shift.rb</a>
</p>

<p>
<a href="../shifts/new.html.erb">../shifts/new.html.erb</a>
</p>

<p>
<a href="../shifts/edit.html.erb">../shifts/edit.html.erb</a>
</p>

<p>
<a href="../../../config/routes.rb">../../../config/routes.rb</a>
</p>
</div>

<div id="outline-container-sec-2-12-1" class="outline-4">
<h4 id="sec-2-12-1"><span class="section-number-4">2.12.1</span> Images</h4>
<div class="outline-text-4" id="text-2-12-1">
<p>
<a href="../../assets/images">../../assets/images</a>
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> picturefill-rails

<p>
<a href="https://github.com/Werbeboten/picturefill-rails">https://github.com/Werbeboten/picturefill-rails</a>
</p>

<pre class="example">
gem 'picturefill'
bundle
</pre>

<p>
<a href="../../views/layouts/application.html.erb">../../views/layouts/application.html.erb</a>
</p>

<pre class="example">
= javascript_include_tag 'picturefill.all'
</pre>

<pre class="example">
&lt;%= picturefill(default_url, "AltText") do %&gt;
  &lt;%= image(small_url) %&gt;
  &lt;%= image(medium_url, :min =&gt; 400) %&gt;
  &lt;%= image(medium_high_dpi_url, :min =&gt; 400, :ratio =&gt; 1.5) %&gt;
  &lt;%= image(large_url, :min =&gt; 1000) %&gt;
  &lt;%= image(large_high_dpi_url, "(min-width: 1000px) and (min-device-pixel-ratio: 1.5)") %&gt;
&lt;%= end %&gt;
</pre>

<p>
<a href="../../views/pages/sandbox.html.erb">../../views/pages/sandbox.html.erb</a>
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-12-2" class="outline-4">
<h4 id="sec-2-12-2"><span class="section-number-4">2.12.2</span> Volunteer Application</h4>
<div class="outline-text-4" id="text-2-12-2">
</div><ol class="org-ol"><li>Wish List<br  /><div class="outline-text-5" id="text-2-12-2-1">
<ul class="org-ul">
<li><code>[X]</code> Users

<p>
New Registration "Create an account" (<a href="../devise/registrations/new.html.erb">devise-new</a>)
</p>

<ul class="org-ul">
<li><code>[X]</code> Add/adjust fields for 
<ul class="org-ul">
<li><code>[X]</code> First Name
</li>
<li><code>[X]</code> Last Name
</li>
<li><code>[X]</code> Phone number
</li>

<li><code>[X]</code> update registration edit as well
</li>
<li><code>[X]</code> will need to update the model, db, etc for change of attributes
</li>
</ul>
</li>
</ul>
</li>

<li><code>[-]</code> Data

<ul class="org-ul">
<li><code>[&#xa0;]</code> Admin download spreadsheet of volunteers
</li>

<li><code>[-]</code> additional info in database for shifts

<p>
<a href="../../../db/seeds.rb">../../../db/seeds.rb</a>
</p>

<ul class="org-ul">
<li><code>[-]</code> Use Activity model to hold additional information for reference

<ul class="org-ul">
<li><code>[X]</code> Work Area
</li>
<li><code>[X]</code> Coordinator
</li>
<li><code>[-]</code> Has Sign?
<ul class="org-ul">
<li><code>[X]</code> add activity comment section 
OR
</li>
<li><code>[&#xa0;]</code> change activity from boolean to string (for comment)
</li>
</ul>
</li>
<li><code>[X]</code> Number of Tickets for activity
</li>
<li><code>[X]</code> General Comment Section (put sign comments here as well?)
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</li>



<li>Issues<br  /><div class="outline-text-5" id="text-2-12-2-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> document array attribute update problem

<p>
UPDATE: Tue Jul  8 05:26:58 UTC 2014
</p>

<p>
I've decided for now to go with a simpler work around for this problem.
</p>

<p>
A user has to be signed in to view the volunteer page. The sign-up text 
fields autofill the user's name. The cancel button only appears if the 
shift volunteer matches the user's name.
</p>
</li>
</ul>


<p>
  The <a href="../shifts/volunteer.html.erb">volunteer view</a> contains a set of divs created by shift
<a href="../../models/shift.rb">  model</a> and <a href="../../controllers/shifts_controller.rb">control</a>. Their behavior is run by a jQuery script.
  Looking at it like a jewelry box, the outside:
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> .container
<ul class="org-ul">
<li><code>[&#xa0;]</code> .
<ul class="org-ul">
<li><code>[&#xa0;]</code> .list-group
<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="../../controllers/shifts_controller.rb">uniq<sub>shifts</sub></a>

<ul class="org-ul">
<li><code>[&#xa0;]</code> shifts = Shift.all

<p>
An ActiveRecord<sub>Relation</sub> of all Shift records
</p>
</li>

<li><code>[&#xa0;]</code> user = current<sub>user</sub>
</li>

<li><code>[&#xa0;]</code> shift<sub>titles</sub> = shifts.pluck(:title)

<p>
an Array of every instance of the Shift attribute, 
title (string)
</p>
</li>

<li><code>[&#xa0;]</code> vols<sub>needed</sub> = shifts.pluck(:vols<sub>needed</sub>)

<p>
Array, volunteers needed for each shift
</p>
</li>

<li><code>[&#xa0;]</code> uniq<sub>shifts</sub> = shift<sub>titles</sub>.uniq

<p>
an Array of only the unique Shift titles        
</p>
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> uniq<sub>shifts</sub>.each do |title|

<pre class="example">
=&gt; ["Signage", "Music", "General Setup and Tear Down" ]
</pre>

<pre class="example">
=&gt; "Signage"
</pre>

<ul class="org-ul">
<li><code>[&#xa0;]</code> shifts<sub>by</sub><sub>title</sub> = shifts.where(title: title)

<p>
Relation: 'set' (???) of records
</p>

<pre class="example">
=&gt; #&lt;ActiveRecord::Relation 
    [#&lt;Shift id: 3, title: "Signage", 
             time: "Saturday 9-11am Setup", 
             vols_needed: 1, 
             created_at: "2014-06-03 20:39:13", 
             updated_at: "2014-07-01 18:01:50", 
             user_ids: "--- []\n"&gt;, 
     #&lt;Shift id: 4, title: "Signage", 
             time: "Saturday 3-5pm Tear Down", 
             vols_needed: 1, 
             created_at: "2014-06-03 20:53:53", 
             updated_at: "2014-07-01 18:01:50", 
             user_ids: "--- []\n"&gt;]&gt; 
</pre>
</li>

<li><code>[&#xa0;]</code> title<sub>vols</sub> = shifts<sub>by</sub><sub>title</sub>.pluck(:vols<sub>needed</sub>).sum

<ul class="org-ul">
<li><code>[&#xa0;]</code> shifts.where(title: "Signage").pluck(:vols<sub>needed</sub>).sum

<pre class="example">
[1, 1]
</pre>
</li>

<li><code>[&#xa0;]</code> [1, 1].sum

<pre class="example">
2
</pre>
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> if title<sub>vols</sub> &gt; 0

<ul class="org-ul">
<li><code>[&#xa0;]</code> Create the activity divs

<ul class="org-ul">
<li><code>[&#xa0;]</code> #activity-title

<pre class="example">
activity-Signage
</pre>

<ul class="org-ul">
<li><code>[&#xa0;]</code> a.list-group-item

<ul class="org-ul">
<li><code>[&#xa0;]</code> title

<pre class="example">
Signage
</pre>
</li>

<li><code>[&#xa0;]</code> .badge-volunteer

<ul class="org-ul">
<li><code>[&#xa0;]</code> title<sub>vols</sub>

<pre class="example">
2
</pre>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> .sub

<ul class="org-ul">
<li><code>[&#xa0;]</code> shifts<sub>by</sub><sub>title</sub>.each do |shift|

<pre class="example">
#&lt;Shift id: 3, title: "Signage", 
        time: "Saturday 9-11am Setup",
        vols_needed: 1,
        created_at: "2014-06-03 20:39:13", 
        updated_at: "2014-07-01 18:01:50", 
        user_ids: "--- []\n"&gt;
</pre>

<ul class="org-ul">
<li><code>[&#xa0;]</code> .list-group-item-sub

<ul class="org-ul">
<li><code>[&#xa0;]</code> shift.time

<pre class="example">
"Saturday 9-11am Setup"
</pre>
</li>

<li><code>[&#xa0;]</code> shift.user<sub>ids</sub>

<pre class="example">
--- []\n
</pre>

<pre class="example">
[4]
</pre>
</li>

<li><code>[&#xa0;]</code> .badge

<ul class="org-ul">
<li><code>[&#xa0;]</code> shift.vols<sub>needed</sub>

<pre class="example">
1
</pre>
</li>
</ul>
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> form<sub>for</sub> shift do |f|

<p>
<a href="../../models/shift.rb">../../models/shift.rb</a>
</p>

<pre class="example">
def add_user_idee(id)
  user_ids_will_change!
  update_attributes user_ids: user_ids + [ id ]
end
</pre>

<ul class="org-ul">
<li><code>[&#xa0;]</code> f.hidden<sub>field</sub> :user<sub>ids</sub>, :value =&gt; shift.add<sub>user</sub><sub>idee</sub>(@user.id)

<pre class="example">
shift.user_ids = [4]
</pre>
</li>

<li><code>[&#xa0;]</code> f.submit "Sign Up"

<p>
Clicking the submit button updates the user<sub>ids</sub> of 
each Shift that exists. Upon further investigation, 
it appears that the user<sub>ids</sub> attributes for each of 
the Shifts are being updated&#x2026;
</p>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> update redirect<sub>to</sub>?
</li>
</ul>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-2-13" class="outline-3">
<h3 id="sec-2-13"><span class="section-number-3">2.13</span> Shifts</h3>
<div class="outline-text-3" id="text-2-13">
<p>
<a href="../shifts">Shifts</a>
</p>


<ul class="org-ul">
<li><code>[&#xa0;]</code> new, minor css
<ul class="org-ul">
<li><code>[&#xa0;]</code> form - select from series(title, time
</li>
<li><code>[&#xa0;]</code> create redirect<sub>to</sub> ?
</li>
<li><code>[&#xa0;]</code> show - minor css
</li>
<li><code>[&#xa0;]</code> notifications, minor css
</li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-2-14" class="outline-3">
<h3 id="sec-2-14"><span class="section-number-3">2.14</span> sandbox</h3>
<div class="outline-text-3" id="text-2-14">
<p>
<a href="./sandbox.html.erb">./sandbox.html.erb</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
